INSERT INTO type_additional_details (id, type_detail)
VALUES
    (1, 'toUser'),
    (2, 'fromUser'),
    (3, 'bookId'),
    (4, 'bookName'),
    (5, 'targetDate'),
    (6, 'borrowDate'),
    (7, 'requiredDate'),
    (8, 'actionLink'),
    (9, 'verificationCode')
    ON CONFLICT DO NOTHING;


INSERT INTO user_notification (user_id, name, email, phone) VALUES
('a1b2c3d4-e5f6-4789-8012-3456789abcde', 'נעמה המשתמשת', 'n0527144459@gmail.com', '0527144459'),
('9f8e7d6c-5b4a-4321-90fe-dcba98765432', 'אורה שר', 'orasher2281@gmail.com', '0527144459')
ON CONFLICT (id) DO NOTHING;


INSERT INTO content (id, subject, content_notification) VALUES
(1,
 'ברוכים הבאים לקהילת הספריה השיתופית!',
 'שלום {toUser}, איזה כיף שהצטרפת אלינו! המערכת שלנו נועדה לחבר בין חברי הקהילה. אנו מזמינים אותך להיכנס למערכת, להגדיר את הפרופיל שלך ולהוסיף את הספר הראשון שלך למאגר.'),

(2,
 'בקשת השאלה חדשה ממתינה לאישורך',
 'שלום {toUser}, התקבלה בקשת השאלה חדשה מהמשתמש {fromUser} עבור הספר "{bookName}". אנא היכנס לאזור האישי במערכת כדי לאשר או לדחות את הבקשה בהקדם האפשרי.'),

(3,
 'איזה כיף, בקשת ההשאלה שלך אושרה!',
 'שלום {toUser}, בקשתך להשאלת הספר "{bookName}" אושרה על ידי {fromUser}. תאריך ההחזרה המתוכנן שנקבע הוא {requiredDate}. היכנס למערכת כדי לראות את פרטי יצירת הקשר לצורך איסוף. קריאה מהנה!'),

(4,
 'בקשה להארכת זמן השאלה עבור הספר שלך',
 'שלום {toUser}, המשתמש {fromUser} שמחזיק כרגע בספר "{bookName}" מבקש להאריך את תקופת ההשאלה. תאריך ההחזרה המקורי הוא {requiredDate}, והתאריך החדש המבוקש הוא {targetDate}. היכנס למערכת כדי לאשר או לדחות את ההארכה.'),

(5,
 'הספר שחיפשת חזר למדף!',
 'שלום {toUser}, אנחנו שמחים לעדכן שהספר "{bookName}" שרצית חזר למלאי והוא זמין כעת להשאלה! היכנס עכשיו למערכת כדי לבקש אותו לפני שמישהו אחר יקדים אותך.'),

(6,
 'אימות חשבון במערכת',
 'שלום רב, קוד האימות שלך לביצוע הפעולה הוא: {verificationCode}. הקוד תקף ל-10 הדקות הקרובות. במידה ולא ביקשת קוד זה, ניתן להתעלם מהודעה זו.'),
(7,
 'תזכורת ידידותית להחזרת ספר',
 'שלום {toUser}, זוהי תזכורת נעימה לכך שמועד ההחזרה של הספר "{bookName}" למשתמש {fromUser} מתקרב. תאריך היעד להחזרה הוא {requiredDate}. אם אתה זקוק לזמן נוסף, ניתן לבקש הארכה דרך האזור האישי.'),

(8,
 'הסיכום הסטטיסטי החודשי שלך זמין כעת',
 'שלום {toUser}, חודש חדש התחיל וזה הזמן להסתכל על ההישגים הקהילתיים שלנו! היכנס למערכת כדי לראות כמה ספרים הושאלו החודש, את החיסכון הכספי המשותף שלנו ואת הפעילות האישית שלך.')
ON CONFLICT DO NOTHING;